# Lab 05: Pandas & DataFrames

In [4]:
%matplotlib inline

# import necessary modules
import pandas as pd, numpy as np, matplotlib.pyplot as plt

In [14]:
# create a pandas dataframe from the location data set
df = pd.read_csv('../data/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [16]:
# Q1: how to get 2 columns from the dataframe (city and country)?
df[['city','country']]

              city         country
0     West Drayton  United Kingdom
1         Hounslow  United Kingdom
2         Hounslow  United Kingdom
3         Hounslow  United Kingdom
4         Hounslow  United Kingdom
...            ...             ...
1754        Munich         Germany
1755        Munich         Germany
1756        Munich         Germany
1757        Munich         Germany
1758        Munich         Germany

[1759 rows x 2 columns]

### Using .loc

In [42]:
# Q2: how to get the first 5 rows of the "city" column?
df.loc[:5,'city']

0    West Drayton
1        Hounslow
2        Hounslow
3        Hounslow
4        Hounslow
5        Hounslow
Name: city, dtype: object

In [22]:
# Q3: how to use .loc to select the third row of the dataframe?
df.loc[2]

lat               51.478199
lon               -0.446081
date       05/14/2014 10:51
city               Hounslow
country      United Kingdom
Name: 2, dtype: object

In [30]:
# Q4: how to use .loc to select the first row in "country" column?
df.loc[0,'country']

'United Kingdom'

In [44]:
# Q5: how to select the first 4 rows of ['city', 'date'] columns?
df.loc[:4, ['city','date']]

           city              date
0  West Drayton  05/14/2014 09:07
1      Hounslow  05/14/2014 09:22
2      Hounslow  05/14/2014 10:51
3      Hounslow  05/14/2014 11:24
4      Hounslow  05/14/2014 11:38

### Using .iloc

In [68]:
# Q6: how to get the value from the row in position 3 and the column in position 2
df.iloc[2,2]

'05/14/2014 10:51'

In [70]:
# Q7: how to use iloc to select every 300th row from a data set
df.iloc[::300]

            lat        lon              date          city         country
0     51.481292  -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
300   41.377091   2.151175  05/20/2014 03:18     Barcelona           Spain
600   50.052338  19.946220  05/31/2014 21:10        Krakow          Poland
900   48.561181   9.059672  06/09/2014 15:12      Tübingen         Germany
1200  41.378301   2.187443  06/17/2014 16:37     Barcelona           Spain
1500  42.208201  20.735993  06/30/2014 08:27       Prizren          Kosovo

## Part 2

In [100]:
# load a reduced set of gps data
df_2 = pd.read_csv('../data/summer-travel-gps-simplified.csv')
df_2.tail()

           lat        lon              date      city  country
173  41.044556  28.983286  07/08/2014 16:44  Istanbul   Turkey
174  41.008992  28.968268  07/08/2014 20:03  Istanbul   Turkey
175  41.043487  28.985488  07/08/2014 22:18  Istanbul   Turkey
176  40.977637  28.823879  07/09/2014 09:03  Istanbul   Turkey
177  48.357110  11.791346  07/09/2014 13:20    Munich  Germany

In [120]:
# Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"
df_2['is_Munich'] = df_2['city'] == 'Munich'
df_2

,lat,lon,date,city,country,is_Munich
0,51.481292,-0.451011,05/14/2014 09:07,West Drayton,United Kingdom,False
1,38.781775,-9.137544,05/14/2014 15:11,Lisbon,Portugal,False
2,38.711050,-9.139739,05/14/2014 16:40,Lisbon,Portugal,False
3,38.715637,-9.120558,05/14/2014 18:25,Lisbon,Portugal,False
4,38.711977,-9.141788,05/14/2014 19:26,Lisbon,Portugal,False
...,...,...,...,...,...,...
173,41.044556,28.983286,07/08/2014 16:44,Istanbul,Turkey,False
174,41.008992,28.968268,07/08/2014 20:03,Istanbul,Turkey,False
175,41.043487,28.985488,07/08/2014 22:18,Istanbul,Turkey,False
176,40.977637,28.823879,07/09/2014 09:03,Istanbul,Turkey,False
177,48.357110,11.791346,07/09/2014 13:20,Munich,Germany,True

In [144]:
# Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it.

spain = df_2[df_2['country'] == 'Spain']

spain = spain[spain['city'] ~ 'Barcelona']

SyntaxError: invalid syntax. Perhaps you forgot a comma? (2825246797.py, line 5)

In [148]:
# Q11: select rows where either the city is munich, or the country is serbia
df_2[(df_2['city'] == 'Munich') | (df_2['country'] == 'Serbia')]

           lat        lon              date       city  country  is_Munich
139  44.821164  20.289821  06/21/2014 01:59   Belgrade   Serbia      False
140  44.820414  20.463465  06/21/2014 18:44   Belgrade   Serbia      False
141  44.761583  19.577904  06/22/2014 07:58  Slepčević   Serbia      False
177  48.357110  11.791346  07/09/2014 13:20     Munich  Germany       True

In [162]:
#Q12: how many observations are west of the prime meridian?
PM_lon = 0.0
df_2.lon.unique()
df_2['west'] = df_2['lon'] < PM_lon
df_2
print("There are",df_2['west'].sum(), "rows west of the prime meridian")

There are 24 rows west of the prime meridian

In [164]:
# Q13: get all rows that contain a city that starts with the letter G
df_2[df_2['city'].str.startswith('G')]

,lat,lon,date,city,country,is_Munich,west
62,50.273632,18.729429,06/02/2014 06:39,Gliwice,Poland,False,False
114,48.282940,8.199630,06/10/2014 13:33,Gutach,Germany,False,False
115,48.389029,8.021342,06/10/2014 13:48,Gengenbach,Germany,False,False
152,40.187825,20.079303,07/04/2014 17:42,Gjirokastër,Albania,False,False

In [170]:
# Q14: how many unique cities and countries in the dataset? 
unique_city = len(df_2.city.unique())
print("There are", unique_city, "Unique cities in this dataset")
unique_country = len(df_2.country.unique())
print("There are", unique_country, "Unique countries in this dataset")

There are 91 Unique cities in this dataset
There are 15 Unique countries in this dataset

In [178]:
# Q15: group by country name and show the city names in each of the country
df_2.groupby("country")['city'].apply(list)

country
Albania                                                [Berat, Gjirokastër]
Bosnia and Herzegovina                         [Sarajevo, Sarajevo, Mostar]
Croatia                                           [Ploče, Split, Dubrovnik]
Czech Republic            [Novy Bohumin, Hranice, Prerov, Ústí nad Orlic...
Germany                   [Kümmersbruck, Winkelhaid, Kammerstein, Ellhof...
Greece                    [Kakavia, Dytiki Ellada, Dytiki Ellada, Dytiki...
Kosovo                                                            [Prizren]
Macedonia (FYROM)                                                   [Ohrid]
Montenegro                                                          [Kotor]
Poland                    [Zendek, Silesian Voivodeship, Dabrowa Gornicz...
Portugal                  [Lisbon, Lisbon, Lisbon, Lisbon, Lisbon, Lisbo...
Serbia                                      [Belgrade, Belgrade, Slepčević]
Spain                     [El Prat de Llobregat, Viladecans, Barcelona, ...
Turkey                    [Istanbul, Istanbul, Istanbul, Istanbul, Istan...
United Kingdom                                               [West Drayton]
Name: city, dtype: object

### Part 3

In [206]:
dt = pd.read_csv('../data/summer-travel-gps-full.csv', index_col='date', parse_dates=True)
dt.head()
dt.shape

(1759, 4)

In [200]:
# Q16: is the timestamp index unique? How can you use code to find it? 
dt[dt.index.duplicated()]

print("No, there is one duplicated value")

No, there is one duplicated value

In [214]:
# Q17: drop duplicate index
dt = dt[~dt.index.duplicated()]

In [216]:
dt.shape
# Shape shows that the duplicated row has been removed.

(1758, 4)

In [236]:
# Q18: create a weekday and a weekend dataframe.
import datetime as datetime
weekday = dt[dt.index.day_name()]


# Q19: calculate and plot the number of observations each day of the week has

KeyError: "None of [Index(['Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday',\n       'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday',\n       ...\n       'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday',\n       'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday', 'Wednesday'],\n      dtype='object', name='date', length=1758)] are in the [columns]"